In [1]:
import pandas as pd 
df = pd.read_csv("type1_data1.csv")

# 1. "subscribed" 컬럼이 2024년 2월인 데이터를 찾으시오 
# 2. 위에서 찾은 데이터 중 "f3" 컬럼이 gold인 데이터의 개수를 구하시오

In [4]:
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          120 non-null    object
 1   age         120 non-null    float64
 2   city        120 non-null    object
 3   f1          89 non-null     float64
 4   f2          120 non-null    int64
 5   f3          91 non-null     object
 6   f4          120 non-null    object
 7   f5          120 non-null    float64
 8   subscribed  120 non-null    object
 9   views       116 non-null    float64
dtypes: float64(4), int64(1), object(5)
memory usage: 9.5+ KB

In [5]:
df["subscribed"] = pd.to_datetime(df["subscribed"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          120 non-null    object
 1   age         120 non-null    float64
 2   city        120 non-null    object
 3   f1          89 non-null     float64
 4   f2          120 non-null    int64
 5   f3          91 non-null     object
 6   f4          120 non-null    object
 7   f5          120 non-null    float64
 8   subscribed  120 non-null    datetime64[ns]
 9   views       116 non-null    float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(4)
memory usage: 9.5+ KB

In [8]:
df["year"] = df["subscribed"].dt.year
df.head()

     id   age city    f1  f2    f3    f4         f5 subscribed   views  year
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791 2024-07-16  6820.0  2024
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826 2024-05-12  2534.0  2024
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986 2024-03-16  7312.0  2024
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078 2024-07-21   493.0  2024
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869 2024-03-07  1338.0  2024

In [10]:
df["month"] = df["subscribed"].dt.month

In [11]:
df.head()

,id,age,city,f1,f2,f3,f4,f5,subscribed,views,year,month
0,id01,2.0,서울,NaN,0,gold,ENFJ,91.297791,2024-07-16,6820.0,2024,7
1,id02,9.0,서울,70.0,1,NaN,ENFJ,60.339826,2024-05-12,2534.0,2024,5
2,id03,27.0,서울,61.0,1,gold,ISTJ,17.252986,2024-03-16,7312.0,2024,3
3,id04,75.0,서울,NaN,2,NaN,INFP,52.667078,2024-07-21,493.0,2024,7
4,id05,24.0,서울,85.0,2,NaN,ISFJ,29.269869,2024-03-07,1338.0,2024,3

In [14]:
cond = (df["year"] == 2024) & (df["month"] == 2)
df = df[cond]

In [17]:
# 2. 위에서 찾은 데이터 중 "f3" 컬럼이 gold인 데이터의 개수를 구하시오 
cond = df["f3"] == "gold" 
sum(cond)

5